import { Link } from "@remix-run/react";
import { useState } from "react";
import { useTranslation } from 'react-i18next';
import TextEllipsis from "./about/TextEllipsis";
import HistorySection from "./about/history";
import ValuesSection from "./about/values";
import ToggleSection from "./about/toggleSection";
import Breadcrumbs from "./Breadcrumbs";


export default function AboutSection() {
    const { t } = useTranslation();
    const [click, setClick] = useState(false);
    const [showContent, setShowContent] = useState<number | null>(null); // Explicitly define the type as number or null

    const handleToggle = (index: number) => {
        setShowContent(prevIndex => (prevIndex === index ? null : index));
    };

    const items = [
        {
            imageSrc: "/images/image.png",
            year: "1970’s",
            description: "بدأ أبو عوف في بيع الفاكهة المجففة والمكسرات بكميات كبيرة وبالجملة.",
        },
        {
            imageSrc: "/images/image.png",
            year: "1980’s",
            description: "وسعت شركة أبو عوف محفظتها، حيث قدمت المزيد من المنتجات والمكونات إلى السوق.",
        },
        {
            imageSrc: "/images/image.png",
            year: "1990’s",
            description: " افتتح أبو عوف مراكز لوجستية في القاهرة والإسكندرية",
        },
        {
            imageSrc: "/images/image.png",
            year: "2000",
            description: " قدم أبو عوف التمر الفاخر للسوق المصري",
        },
        {
            imageSrc: "/images/image.png",
            year: "2010",
            description: " تم تقديم العلامة التجارية تحت اسم 'أبو عوف' وتم افتتاح أول متجر مميز لدينا في الميرغني.",
        },
        {
            imageSrc: "/images/image.png",
            year: "2018",
            description: "  وسعت شركة أبو عوف نطاق منتجاتها وقدمت مجموعة صحية من المنتجات المختلفة إلى السوق. ",
        },
        {
            imageSrc: "/images/image.png",
            year: "2019",
            description: "أطلق أبو عوف موقعه على الإنترنت واكتسب المزيد من التقدير في جميع أنحاء العالم.",
        },
        {
            imageSrc: "/images/image.png",
            year: "2021",
            description: "أطلقت شركة أبو عوف تطبيق الهاتف الخاص بها مما وفر وصولاً أسهل لعملائها وسهّل عملية الشراء.",
        },
        // Add more items here...
    ];
    const values = [
        {
            title: "الثقة والولاء هم سلاحنا للنجاح",
            description: "فريقنا لديه التزام عميق بالتميز والتفاني في تقديم مجموعة متنوعة من الخدمات؛ فرضاء العملاء هو ركيزة نجاحنا، حيث يتأكد فريقنا من أخذ كل التعليقات بعين الاعتبار ويعمل عليها لمواصلة بناء وتجديد اسم علامتنا التجارية باستمرار واكتساب ثقة وولاء عملائنا.",
        },
        {
            title: "الصدق والنزاهة والالتزام قيَم أساسية نتمسك بها",
            description: "نستثمر باستمرار مبالغ كبيرة من رأس مال الشركة حتى نتمكن من الاستمرار في تقديم خدمة متميزة وجودة فائقة ودعم عملاء احترافي، كما نستثمر في المعرفة المهارات جديدة لتطوير منتجاتنا وعمليات التحميص. حيث نسعى جاهدين للبقاء دائمًا على مستوى توقعات عملائنا.",
        },
        {
            title: "مسؤولية الريادة بأسواق المنتجات العضوية",
            description: "مسؤولياتنا كشركة تقع على رأس قائمة أولوياتنا، فجزء من مسؤولياتنا هو جعل مهمتنا هي توفير قهوة ومكسرات ومنتجات غذائية صحية ذات جودة عالية مع تأثير بيئي منخفض. من الفكرة وحتى الاستهلاك ننقل الحب والرعاية إلى منتجاتنا وخدماتنا، فنعتني بالطبيعة والبيئة وجميع الأشخاص المشاركين في تقديم منتجاتنا إليك.",
        },
        {
            title: "روح العائلة بالفريق",
            description: "نخلق بيئة عمل صحية تدفع كل عضو للتميز في منطقته؛ حيث نعمل كعائلة على ابتكار وتحسين وتقديم أفضل جودة وخدمة في السوق.",
        },
    ];
    const missions = [
        {
            title: "نحن نعيش ونستهلك ونتنفس منتجات عضوية ",
            description: "استنادًا إلى التزامنا المستمر بتقديم طعام عضوي 100٪ ومن مصادر أخلاقية ومستدامة؛ يعتمد نجاحنا على الحصول على مواد خام عالية الجودة من جميع أنحاء العالم. واليوم، تقدم أبو عوف أكثر من 400 منتج عضوي ممتاز إلى مناطق مختلفة في جميع أنحاء العالم.",
        },
        {
            title: "في كل مرة تختار أبو عوف فإنك تختار مستقبلاً أكثر صحة لها",
            description: "نستثمر باستمرار مبالغ كبيرة من رأس مال الشركة حتى نتمكن من الاستمرار في تقديم خدمة متميزة وجودة فائقة ودعم عملاء احترافي، كما نستثمر في المعرفة المهارات جديدة لتطوير منتجاتنا وعمليات التحميص. حيث نسعى جاهدين للبقاء دائمًا على مستوى توقعات عملائنا.",
        },
        {
            title: "جذورنا تمتد عميقًا لنقدم جودة عالية",
            description: "مسؤولياتنا كشركة تقع على رأس قائمة أولوياتنا، فجزء من مسؤولياتنا هو جعل مهمتنا هي توفير قهوة ومكسرات ومنتجات غذائية صحية ذات جودة عالية مع تأثير بيئي منخفض. من الفكرة وحتى الاستهلاك ننقل الحب والرعاية إلى منتجاتنا وخدماتنا، فنعتني بالطبيعة والبيئة وجميع الأشخاص المشاركين في تقديم منتجاتنا إليك.",
        },
    ];
    const breadcrumbs = {
        pages: [
            { name: 'Home', href: '/' },
            { name: 'About', href: '#' },
        ]
    }
    
    return (

        <section className=" w-full">
            <div className="hero bg-green-300 pt-4 pb-16">
                <div className="details container mx-auto md:px-24 px-4">
                <Breadcrumbs breadcrumbs={breadcrumbs.pages} className="pb-4 border-b border-gray-200" />
                    <img src="/images/about/about-hero.png" alt="" />
                    <TextEllipsis
                        width='w-2/3'
                        title="نحن نغير مفهوم الأكل الصحي في جميع أنحاء العالم"
                        content="تأسست شركة أبو عوف في عام 2010 وأصبحت من أشهر الأسماء في الأسواق لتقديم منتجات القهوة الطبيعية عالية الجودة والمكسرات وزبد المكسرات والأطعمة الصحية والفاكهة المجففة.. وأكثر فلكل مُنتَج حكايته الخاصة؛ وبسبب اهتمامنا المستمر بالتفاصيل، فإن كل خطوة في عملية الإنتاج في أبو عوف تُدار بعناية لضمان إنتاج منتجات عالية الجودة يتم توصيلها بحب وملئها بالمكونات المغذية من الطبيعة الأم نعطي الأولوية لابتكار المنتجات ونأخذ في الاعتبار اتجاهات السوق ورغبات العملاء وتغيُّر الأذواق، كما نشجع دائمًا نمط الحياة الصحي؛ لأن هدفنا ليس فقط تغذية الجسم، بل تغذية العقل والروح أيضًا، وذلك من خلال مجموعة متنوعة من الأعشاب والمنتجات العضوية المختلفة. نأمل في حكي قصة التغيير الذي يمكنك إحداثه في العالم عندما تقوم بتغيير عادات الأكل الخاصة بك إلى عادات صحية وممتعة ولذيذة."
                    />
                </div>
            </div>
            <HistorySection />
            <ValuesSection />
            <div className="container mx-auto md:py-16 md:px-0 py-6 px-4">
                <div className="flex items-center flex-col md:flex-row ">
                    <div className="image md:w-1/2 w-full md:mr-9 mb-4 md:mb-0 ">
                        <img src="/images/about/image13.png" alt="" className="rounded-3xl" />
                    </div>
                    <div className="text md:w-1/2 w-full md:ml-9">
                        <h3 className="text-green-400 font-bold md:text-5xl md:mb-6 mb-3 text-xl">المهمة والرؤية</h3>
                        <p className="text-gray-50 font-semibold md:leading-9 md:text-2xl text-sm">"أبو عوف تم تأسيسها برؤية لتغيير مستقبل الغذاء. فمن قال أن الغذاء الصحي لا يمكن أن يكون لذيذًا؟"</p>
                        <ToggleSection />
                    </div>

                </div>
                <div className="flex items-center flex-col-reverse md:flex-row  md:mt-40 mt-6">
                    <div className="text md:w-1/2 w-full md:mr-9 ">
                        <h3 className="text-green-400 font-bold md:text-5xl md:mb-6 mb-3 text-xl">أبو عوف حاليًا </h3>
                        <TextEllipsis
                            lineClampNumber={5}
                            textAlign="text-start"
                            content="لدينا الآن أكثر من 150 فرعًا في مصر ويمكن العثور على منتجاتنا في معظم محلات السوبر ماركت الكبرى في مثل كارفور ومترو وأولاد رجب وبنده وأوسكار وسعودي وهايبر وان وسبينس
                            كما نقوم بتوريد العديد من منتجاتنا إلى مجموعة من أفخم سلاسل الفنادق مثل سانت ريجيس وفور سيزونز وجي دبليو ماريوت وماريوت ولو ميريديان وريتز كارلتون وويستن، بالإضافة إلى شركة السوق الحرة وشركة مصر للطيران التي نمدها بمنتجاتنا لأكثر من 10 سنوات.
                            أخيرًا وليس آخرًا، ونظرًا لأننا نريد التأكد من أنك دائمًا مستيقظ ولديك كمية جيدة من الطاقة على الطريق، لذا نقدم قهوة أبو عوف التركية الخاصة في 55 محطة وقود ويمكن أيضًا العثور على شاي بالنكهات في 20 محطة
                            نتأكد من تلبية ذوق كل عميل ونوفر مجموعة متنوعة من المنتجات التي لا غنى عنها للاستهلاك اليومي من المأكولات والمشروبات، مثل القهوة والشاي والعسل ... إلخ. فـ'أبو عوف' هو العلامة التجارية المفضلة في سوق الوجبات الخفيفة الصحية واللذيذة، حيث ونوفر وصولاً سهلاً إلى طعام صحي ونشجع أسلوب حياة صحي."
                        />
                    </div>
                    <div className="image md:w-1/2 w-full md:ml-9 mb-4 md:mb-0 ">
                        <img src="/images/about/image14.png" alt="" className="rounded-3xl" />
                    </div>
                </div>
            </div>
        </section>
    )
}
